Revit 2025 API
EnergyAnalysisOpening.GetConstruction Method
 Gets the analytic construction this surface is associated with. Null when this surface is a window.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public EnergyAnalysisConstruction GetConstruction()
Public Function GetConstruction As EnergyAnalysisConstruction
public:
EnergyAnalysisConstruction^ GetConstruction()
member GetConstruction : unit -> EnergyAnalysisConstruction
Return Value
EnergyAnalysisConstruction
 The analytic construction.
See Also
Reference
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace